Repository: RomanBelkov/DiskImager
Catalog: DiskImager/Properties/Resources.*.resx
Languages: ru

# MainForm_ButtonReadClick_____WARNING____
source: *** WARNING ***
ru: ***ВНИМАНИЕ***

# MainForm_ButtonReadClick_Problem_with_reading_from_disk_
source: Problem with reading from disk.
ru: Проблема при чтении с диска

# MainForm_ButtonReadClick_Read_Error
source: Read Error
ru: Ошибка чтения

# MainForm_ButtonReadClick_You_can_read_from_only_one_drive_at_a_time
source: You can read from only one drive at a time. Please select only one drive from drive list.
ru: Считывать можно только с одного диска одновременно. Пожалуйста, выберите только один диск.

# MainForm_ButtonWriteClick_C__is_almost_certainly_your_main_HDD
source: C: is almost certainly your main hard drive. Writing to this will likely destroy your data, and brick your PC. Are you absolutely sure you want to do this?
ru: Диск C: наверняка является основным жёстким диском Вашего компьютера. Запись на этот диск может повредить данные на Вашем компьютере.

# MainForm_ButtonWriteClick_Problem_writing_to_disk__Is_it_write_protected_
source: Problem writing to disk. Is it write-protected?
ru: Ошибка записи на диск. Пожалуйста, проверьте, не защищён ли диск от записи.

# MainForm_ButtonWriteClick_Write_Error
source: Write Error
ru: Ошибка записи

# MainForm_MainForm_Image_Files__Choose
source: Image Files (*.img,*.bin,*.sdcard)|*.img;*.bin;*.sdcard|Compressed Files (*.zip,*.gz,*tgz)|*.zip;*.gz;*.tgz|All files (*.*)|*.*
ru: Файлы образов (*.img,*.bin,*.sdcard)|*.img;*.bin;*.sdcard|XZ архивы (*.xz)|*.xz|ZIP архивы (*.zip)|*.zip|GZ архивы (*.gz,*.tgz)|*.gz;*.tgz|Все файлы (*.*)|*.*

# MainForm_MainForm_Initialised__Licensed_under_GPLv3__Use_at_own_risk_
source: Initialised. Licensed under GPLv3. Use at own risk!
ru: Программа лицензирована GNU GPL v3. Авторы не несут ответственность за ущерб!

# Disk_ReadDrive__Physical__
source: (Physical:
ru: (Физический:

# Disk_ReadDrive_Elapsed_time__
source: Elapsed time:
ru: Время:

# Disk_ReadDrive_Error_reading_data_from_drive__
source: Error reading data from drive:
ru: Ошибка чтения с диска:

# Disk_ReadDrive_Error_reading_data_from_drive___past_EOF_
source: Error reading data from drive - past EOF?
ru: Ошибка чтения. Ушли за EOF?

# Disk_ReadDrive_No_valid_partitions_on_drive
source: No valid partitions on drive
ru: На диске нет доступных разделов

# Disk_ReadDrive_Problem_with_filesystem__It_reports_it_is_larger_than_the_disk_
source: Problem with filesystem. It reports it is larger than the disk!
ru: Проблема с файловой системой!

# Disk_ReadDrive_Read_
source: Read
ru: Чтение

# Disk_WriteDrive__bytes__Elapsed_time_
source: bytes. Elapsed time
ru: байт. Время

# Disk_WriteDrive__doesn_t_exist
source: doesn't exist
ru: не существует

# Disk_WriteDrive_All_Done___Wrote_
source: All Done - Wrote
ru: Операция выполнена. Записано

# Disk_WriteDrive_Cancelled
source: Cancelled
ru: Отменено

# Disk_WriteDrive_Elapsed_time__
source: Elapsed time:
ru: Время:

# Disk_WriteDrive_Error__Couldn_t_map_partition_to_physical_drive
source: Error: Couldn't map partition to physical drive
ru: Ошибка: раздел не может быть записан на диск

# Disk_WriteDrive_Error_reading_zip_input_stream
source: Error reading zip input stream
ru: Ошибка чтения zip

# Disk_WriteDrive_Error_writing_data_to_drive__
source: Error writing data to drive:
ru: Ошибка записи данных на диск:

# Disk_WriteDrive_Error_writing_data_to_drive___past_EOF_
source: Error writing data to drive - past EOF?
ru: Ошибка записи данных на диск. Прошли EOF?

# Disk_WriteDrive_Failed_to_get_device_size
source: Failed to get device size
ru: Невозможно получить размер устройства

# Disk_WriteDrive_Failed_to_lock_drive
source: Failed to lock drive
ru: Невозможно получить доступ к устройству

# Disk_WriteDrive_Failed_to_open_physical_drive
source: Failed to open physical drive
ru: Невозможно открыть доступ к диску

# Disk_WriteDrive_Wrote_
source: Wrote
ru: Записано
